BaseConfiguration/Money_2_0/DataProcessors/МониторСинхронизацииССервисом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>МониторСинхронизацииССервисом</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

BaseConfiguration/Money_2_0/Enums/ВидыТранспортаСообщенийОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыТранспортаСообщенийОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>EMAIL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FILE</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FTP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>COM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексДиск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Dropbox</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GoogleDrive</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WSПассивныйРежим</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешняяСистема</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BaseConfiguration/Money_2_0/Enums/СценарииСинхронизацииАвтономныхКопий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СценарииСинхронизацииАвтономныхКопий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбъединениеДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаменитьВсеВЦентральнойБазе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаменитьВсеВАвтономнойКопии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BaseConfiguration/Money_2_0/DataProcessors/МониторСинхронизацииССервисом/Forms/Монитор/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	ЦентральнаяБаза = СинхронизацияАвтономныхКопийВызовСервера.УзелЦентральнойБазы();
	Если Режим <> "Неразделенный" И Режим <> "Разделенный" Тогда
		ПрочитатьНастройкиИРезультаты();
		
		ОбновитьПодсказкуСценария(Элементы.СценарийСинхронизации, СценарийСинхронизации, Режим);
	КонецЕсли;
	
	ЗакрыватьФормуПослеСинхронизации = Параметры.Свойство("ЗакрыватьФормуПослеСинхронизации") 
		И Параметры.ЗакрыватьФормуПослеСинхронизации;
		
	Если Параметры.Свойство("АвтоматическоеДействие") Тогда
		АвтоматическоеДействие = Параметры.АвтоматическоеДействие;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Режим = "Неразделенный" Или Режим = "Разделенный" Тогда
		Отказ = Истина;
		ОткрытьФорму("ПланОбмена.СинхронизацияАвтономныхКопий.ФормаСписка");
		Возврат;
	КонецЕсли;
	
	ОбновитьСостояниеСинхронизацииКлиент();
	
	Если Не ПустаяСтрока(АвтоматическоеДействие) Тогда
		ПодключитьОбработчикОжидания(АвтоматическоеДействие, 0.2, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Или Не Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	#Область ПоказатьВопрос
	ТекстВопроса = НСтр("ru='Сохранить изменения?'");
	
	ДополнительныеПараметры = Новый Структура;
	Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да,     НСтр("ru='Да'"));
	Кнопки.Добавить(КодВозвратаДиалога.Нет,    НСтр("ru='Нет'"));
	Кнопки.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru='Отмена'"));
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, , КодВозвратаДиалога.Да, Заголовок);
	#КонецОбласти
	 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполненОбменДанными" Тогда
		ПрочитатьНастройкиИРезультаты();
		Если ЗакрыватьФормуПослеСинхронизации и Открыта() Тогда
			Модифицированность = Ложь;
			Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СценарийСинхронизацииПриИзменении(Элемент)
	ОбновитьПодсказкуСценария(Элементы.СценарийСинхронизации, СценарийСинхронизации, Режим);
	ЗаписатьСценарийСинхронизации();
КонецПроцедуры

&НаКлиенте
Процедура ПриостановитьСинхронизациюПриИзменении(Элемент)
	
	ЗаписатьРежимСинхронизации();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)
	ВыгрузитьВФайлКлент();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	ЗагрузитьИзФайлаКлент();
КонецПроцедуры

&НаКлиенте
Процедура Перечитать(Команда)
	ПрочитатьНастройкиИРезультаты();
	ОбновитьСостояниеСинхронизацииКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьИЗакрыть(Команда)
	
	СохранитьИзмененияНаКлиенте();
	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	СохранитьИзмененияНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьСейчас(Команда)
	
	Если Модифицированность Тогда
		СохранитьИзмененияНаКлиенте();
	КонецЕсли;
	
	ЕстьЛицензии = Истина;
	ПроверитьДоступностьСинхронизации(ЕстьЛицензии);
	
	//ОбменДаннымиКлиент.ВыполнитьОбменДаннымиОбработкаКоманды(ЦентральнаяБаза, ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура("УзелИнформационнойБазы,ВидТранспорта,ВыполнятьВыгрузку,ВыполнятьЗагрузку,ИмяФайлаВыгрузки");
	ПараметрыФормы.УзелИнформационнойБазы = ЦентральнаяБаза;
	ПараметрыФормы.ВидТранспорта = ПредопределенноеЗначение("Перечисление.ВидыТранспортаСообщенийОбмена.WS");
	ПараметрыФормы.ВыполнятьВыгрузку = ЕстьЛицензии 
			И СценарийСинхронизации <> ПредопределенноеЗначение("Перечисление.СценарииСинхронизацииАвтономныхКопий.ЗаменитьВсеВАвтономнойКопии");
	ПараметрыФормы.ВыполнятьЗагрузку = СценарийСинхронизации <> ПредопределенноеЗначение("Перечисление.СценарииСинхронизацииАвтономныхКопий.ЗаменитьВсеВЦентральнойБазе");
	
	ОткрытьФорму("Обработка.МониторСинхронизацииССервисом.Форма.ИнтерактивнаяОперация", ПараметрыФормы);
	
	ПодключитьОбработчикОжидания("ОбновитьСостояниеСинхронизацииКлиент", 1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеПодписками(Команда)
	
	ОткрытьФорму("Обработка.УправлениеПодписками.Форма.СостояниеПодписок");
	
КонецПроцедуры

&НаКлиенте
Процедура УзелЦентральнойБазы(Команда)
	ПараметрыФормы = Новый Структура("Ключ", ЦентральнаяБаза);
	ОткрытьФорму("ПланОбмена.СинхронизацияАвтономныхКопий.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьДляЗагрузкиВсеЗаписиОблака(Команда)
	ОтметитьДляЗагрузкиВсеЗаписиОблакаСервер()
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьВсе(Команда)
	
	ЗарегистрироватьВсеДляОтправкиСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСинхронизированностьДанных(Команда)
	
	РеультатПроверки = ВыполнитьПроверкуСервер(ЦентральнаяБаза);
	Если РеультатПроверки = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru='Ключевые данные этой базы идентичны данным облака'") );
		Возврат;
	КонецЕсли;
	
	РеультатПроверки.Показать(НСтр("ru='Проверка синхронизированности данных'") );
	
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьИтоги(Команда)
	ПараметрыФормы = Новый Структура("Ключ", ЦентральнаяБаза);
	ОткрытьФорму("ПланОбмена.СинхронизацияАвтономныхКопий.Форма.ПросмотрУзла", ПараметрыФормы);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыгрузитьВФайлКлент()
	ДиалогФайлаВыгрузки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаКлент()
	ДиалогФайлаВыгрузки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДиалогФайлаВыгрузки(ЭтоЗагрузка)
	
	Если Модифицированность Тогда
		СохранитьИзмененияНаКлиенте();
	КонецЕсли;
	
	ВыборФайла = Новый ДиалогВыбораФайла(?(ЭтоЗагрузка, РежимДиалогаВыбораФайла.Открытие, РежимДиалогаВыбораФайла.Сохранение));
	ВыборФайла.МножественныйВыбор = Ложь;
	ВыборФайла.ПолноеИмяФайла = ИмяФайлаВыгрузки;
	ВыборФайла.Расширение = "xml";
	ВыборФайла.Фильтр = "Файл выгрузки (*.xml)|*.xml|Все файлы (*.*)|*.*";
	ВыборФайла.ПроверятьСуществованиеФайла = ЭтоЗагрузка;
	ВыборФайла.МножественныйВыбор = Ложь;
	ВыборФайла.Заголовок = ?(ЭтоЗагрузка, НСтр("ru='Укажите файл для выгрузки'"), НСтр("ru='Укажите файл для загрузки'"));
	
	Оповещение = Новый ОписаниеОповещения("ДиалогФайлаВыгрузки_Завершение", ЭтотОбъект, ЭтоЗагрузка);
	ВыборФайла.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ДиалогФайлаВыгрузки_Завершение(ВыбранныеФайлы, ЭтоЗагрузка) Экспорт
	
	Если Не ЗначениеЗаполнено(ВыбранныеФайлы) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("УзелИнформационнойБазы,ВидТранспорта,ВыполнятьВыгрузку,ВыполнятьЗагрузку,ИмяФайлаВыгрузки");
	ПараметрыФормы.УзелИнформационнойБазы = ЦентральнаяБаза;
	ПараметрыФормы.ВидТранспорта       = ПредопределенноеЗначение("Перечисление.ВидыТранспортаСообщенийОбмена.FILE");
	ПараметрыФормы.ВыполнятьВыгрузку   = Не ЭтоЗагрузка;
	ПараметрыФормы.ВыполнятьЗагрузку   = ЭтоЗагрузка;
	ПараметрыФормы.ИмяФайлаВыгрузки    = ВыбранныеФайлы[0];
	
	ОткрытьФорму("Обработка.МониторСинхронизацииССервисом.Форма.ИнтерактивнаяОперация", ПараметрыФормы, ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПодсказкуСценария(ЭлементСценария, Сценарий, Режим)
	
	Если Сценарий = ПредопределенноеЗначение("Перечисление.СценарииСинхронизацииАвтономныхКопий.ЗаменитьВсеВАвтономнойКопии") Тогда
		ТекстПодсказки = ?(Режим = "Разделенный", 
					НСтр("ru='Записи в локальной копии будут удалены. Вместо них будут загружены данные из облака'"), //текст для облака
					НСтр("ru='Перед синхронизацией эта база будет очищена. Все данные будут заменены данными облака'")); //текст для автономного клиента
	ИначеЕсли Сценарий = ПредопределенноеЗначение("Перечисление.СценарииСинхронизацииАвтономныхКопий.ЗаменитьВсеВЦентральнойБазе") Тогда
		ТекстПодсказки = ?(Режим = "Разделенный", 
					НСтр("ru='Записи в этой базе и в других локальных копия будут удалены. Вместо них будут загружены данные из выделенного узла'"), //текст для облака
					НСтр("ru='Данные в облаке и в других подключенных к нему базах будут замещены данными этой базы'")); //текст для автономного клиента
	Иначе
		ТекстПодсказки = НСтр("ru='База и облако обменяются изменениями'");
	КонецЕсли;
	
	ЭлементСценария.Подсказка = ТекстПодсказки;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзмененияНаКлиенте()
	
	СохранитьИзменения();
	Оповестить("ИзмененаСинхронизация");
	
КонецПроцедуры

&НаСервере
Процедура СохранитьИзменения()
	
	// записывает изменение сценария
	СценарийОбъединения = Перечисления.СценарииСинхронизацииАвтономныхКопий.ОбъединениеДанных;
	Если СценарийСинхронизации = Перечисления.СценарииСинхронизацииАвтономныхКопий.ЗаменитьВсеВАвтономнойКопии Тогда
		Изменения = Новый Структура("ЗатребованныйСценарий,СценарийЗапрашиваемыхДанных,СценарийПереданныхДанных", 
			СценарийСинхронизации, СценарийСинхронизации, СценарийОбъединения);
			
	ИначеЕсли СценарийСинхронизации = Перечисления.СценарииСинхронизацииАвтономныхКопий.ЗаменитьВсеВЦентральнойБазе Тогда
		Изменения = Новый Структура("ЗатребованныйСценарий,СценарийЗапрашиваемыхДанных,СценарийПереданныхДанных", 
			СценарийСинхронизации, СценарийОбъединения, СценарийСинхронизации);
	Иначе
		Изменения = Новый Структура("СценарийЗапрашиваемыхДанных,ЗатребованныйСценарий,СценарийПереданныхДанных", 
			СценарийОбъединения, СценарийОбъединения, СценарийОбъединения);
	КонецЕсли;
	
	СинхронизацияАвтономныхКопий.ЗаписатьНовыеПараметрыОбменаСУзлом(ЦентральнаяБаза, Изменения);
	
	ДеньгиОбменСЦентральнойБазой.ИзменитьИспользованиеЗаданияСинхронизацииСЦентральнойБазой(СпособСинхронизации <> 1, ЦентральнаяБаза);
	
	ПрочитатьНастройкиИРезультаты();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройкиИРезультаты()
	
	РегЗадание = АвтоматСинхронизацииССервисом.РегламентноеЗаданиеОбмена();
	Если РегЗадание = Неопределено Тогда
		Элементы.СпособСинхронизации.Доступность = Ложь;
		ТекущееПриостановитьСинхронизацию = Ложь;
	Иначе
		Элементы.СпособСинхронизации.Доступность = Истина;
		ТекущееПриостановитьСинхронизацию = Не РегЗадание.Использование;
	КонецЕсли;
	СпособСинхронизации = ТекущееПриостановитьСинхронизацию;
	Если ТекущееПриостановитьСинхронизацию <> Константы.ДеньгиПриостановитьАвтосинхронизацию.Получить() Тогда
		Константы.ДеньгиПриостановитьАвтосинхронизацию.Установить(ТекущееПриостановитьСинхронизацию);
	КонецЕсли;
	
	СценарийСинхронизации      = ЦентральнаяБаза.ЗатребованныйСценарий;
	
	// результаты синхронизации
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Узел", ЦентральнаяБаза);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(СостоянияОбменовДанными.ДатаНачала) КАК ДатаНачала,
	|	СостоянияОбменовДанными.УзелИнформационнойБазы КАК УзелИнформационнойБазы
	|ПОМЕСТИТЬ МаксДата
	|ИЗ
	|	РегистрСведений.СостоянияОбменовДанными КАК СостоянияОбменовДанными
	|ГДЕ
	|	СостоянияОбменовДанными.УзелИнформационнойБазы = &Узел
	|
	|СГРУППИРОВАТЬ ПО
	|	СостоянияОбменовДанными.УзелИнформационнойБазы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СостоянияОбменовДанными.ДействиеПриОбмене КАК ДействиеПриОбмене,
	|	СостоянияОбменовДанными.РезультатВыполненияОбмена КАК РезультатВыполненияОбмена,
	|	СостоянияОбменовДанными.ДатаНачала КАК ДатаНачала,
	|	СостоянияОбменовДанными.ДатаОкончания КАК ДатаОкончания,
	|	СостоянияУспешныхОбменовДанными.ДатаОкончания КАК ПоследняяУспешнаяДата
	|ИЗ
	|	МаксДата КАК МаксДата
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОбменовДанными КАК СостоянияОбменовДанными
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияУспешныхОбменовДанными КАК СостоянияУспешныхОбменовДанными
	|			ПО СостоянияОбменовДанными.УзелИнформационнойБазы = СостоянияУспешныхОбменовДанными.УзелИнформационнойБазы
	|				И СостоянияОбменовДанными.ДействиеПриОбмене = СостоянияУспешныхОбменовДанными.ДействиеПриОбмене
	|		ПО МаксДата.УзелИнформационнойБазы = СостоянияОбменовДанными.УзелИнформационнойБазы
	|			И МаксДата.ДатаНачала <= СостоянияОбменовДанными.ДатаНачала
	|ГДЕ
	|	СостоянияОбменовДанными.УзелИнформационнойБазы = &Узел";
	
	РезультатПоследнейСинхронизации = "";
	ТекущееСостояниеСинхронизации   = "";
	
	Если ОбщегоНазначения.РазделениеВключено()
		И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РегистрСведений.СостоянияОбменовДанными", "РегистрСведений.СостоянияОбменовДаннымиОбластейДанных");
	КонецЕсли;
	
	БылиОшибки = Ложь;
	Успех      = Дата(1,1,1);
	ДатаОшибки = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.ПоследняяУспешнаяДата) И Выборка.ПоследняяУспешнаяДата > Успех Тогда
			Успех = Выборка.ПоследняяУспешнаяДата;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.РезультатВыполненияОбмена) И Выборка.РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.Отменено Тогда
			БылиОшибки = Истина;
			ДатаОшибки = Выборка.ДатаНачала;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Успех) Тогда
		РезультатПоследнейСинхронизации = Формат(Успех, "ДФ='dd.MM.yyyy HH:mm:ss'");
	КонецЕсли;
	
	Если БылиОшибки Тогда
		ТекущееСостояниеСинхронизации = СтрШаблон("в %1 возникли ошибки синхронизации. См. записи в журнале", Формат(ДатаОшибки, "ДФ='dd.MM.yyyy HH:mm:ss'"));
	КонецЕсли;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьСостояниеСинхронизации(Форма)
	
	Форма.ИдентификаторЗаданияСинхронизации = Неопределено;
	ЗаданиеСинхронизации = ФоновоеЗаданиеОбмена();
	Если ЗаданиеСинхронизации <> Неопределено 
		И ЗаданиеСинхронизации.Статус = "Выполняется" Тогда
		Форма.Элементы.ДекорацияИндикатор.Картинка = БиблиотекаКартинок.СинхронизацияИдетОбмен48;
		Форма.ИдентификаторЗаданияСинхронизации = ЗаданиеСинхронизации.УникальныйИдентификатор;
		Форма.ТекущееСостояниеСинхронизации = НСтр("ru='выполняется сейчас...'");
	Иначе
		Форма.Элементы.ДекорацияИндикатор.Картинка = БиблиотекаКартинок.СинхронизацияНетОбмена48;
	КонецЕсли;
	
	Форма.Элементы.СинхронизироватьСейчас.Доступность = Не ЗначениеЗаполнено(Форма.ИдентификаторЗаданияСинхронизации);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ФоновоеЗаданиеОбмена()
	
	Возврат АвтоматСинхронизацииССервисом.ФоновоеЗаданиеОбмена();
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСостояниеСинхронизацииКлиент()
	
	ОбновитьСостояниеСинхронизации(ЭтотОбъект);
	Если ИдентификаторЗаданияСинхронизации <> Неопределено  Тогда
		ПодключитьОбработчикОжидания("ОбновитьСостояниеСинхронизацииКлиент", 1, Истина);
	ИначеЕсли СпособСинхронизации <> 1 Тогда
		ПодключитьОбработчикОжидания("ОбновитьСостояниеСинхронизацииКлиент", 60, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		СохранитьИзмененияНаКлиенте();
		Если Не Модифицированность И Открыта() Тогда
			Закрыть();
		КонецЕсли;
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПроверитьДоступностьСинхронизации(ЕстьЛицензии = Истина)
	
	СостояниеПодписки = ДеньгиВОблаке.СостояниеПодпискиНаУслугу(ДеньгиВОблаке.ИмяУслугиАвтоСинхронизация(), 
			СинхронизацияАвтономныхКопийВызовСервера.КодЭтогоУзла());
	Если СостояниеПодписки = Неопределено Тогда
		ВызватьИсключение НСтр("ru='Не удалось проверить состояние подписки. Возможно, сервер временно недоступен'");
	ИначеЕсли СостояниеПодписки.ИБЗапрещена Тогда
		ВызватьИсключение НСтр("ru='Соединение с этой информационной базой запрещено в облаке. Синхронизация невозможна'");
	ИначеЕсли СостояниеПодписки.ИБУстаревшая Тогда
		ВызватьИсключение НСтр("ru='Эта информационная база отмечена в облаке как устаревшая. Синхронизация невозможна'");
	ИначеЕсли СостояниеПодписки.ВсегоЛицензий <> -111 И СостояниеПодписки.СвободноЛицензий < 0 Тогда
		ЕстьЛицензии = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю( НСтр("ru='Недостаточно лицензий. Синхронизация работает только в режиме получения данных из облака'") );
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста 
Процедура ОтметитьДляЗагрузкиВсеЗаписиОблакаСервер()
	АвтоматСинхронизацииССервисом.УстановитьРегистрациюИзмененийНаСервере("Зарегистрировать все");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗарегистрироватьВсеДляОтправкиСервер()
	ПланыОбмена.ЗарегистрироватьИзменения(СинхронизацияАвтономныхКопийВызовСервера.УзелЦентральнойБазы("СинхронизацияАвтономныхКопий"));
КонецПроцедуры
 

&НаСервере
Процедура ЗаписатьРежимСинхронизации()
	
	ДеньгиОбменСЦентральнойБазой.ИзменитьИспользованиеЗаданияСинхронизацииСЦентральнойБазой(СпособСинхронизации <> 1, ЦентральнаяБаза);
	ПрочитатьНастройкиИРезультаты();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСценарийСинхронизации()
	
	// записывает изменение сценария
	СценарийОбъединения = Перечисления.СценарииСинхронизацииАвтономныхКопий.ОбъединениеДанных;
	Если СценарийСинхронизации = Перечисления.СценарииСинхронизацииАвтономныхКопий.ЗаменитьВсеВАвтономнойКопии Тогда
		Изменения = Новый Структура("ЗатребованныйСценарий,СценарийЗапрашиваемыхДанных,СценарийПереданныхДанных", 
			СценарийСинхронизации, СценарийСинхронизации, СценарийОбъединения);
			
	ИначеЕсли СценарийСинхронизации = Перечисления.СценарииСинхронизацииАвтономныхКопий.ЗаменитьВсеВЦентральнойБазе Тогда
		Изменения = Новый Структура("ЗатребованныйСценарий,СценарийЗапрашиваемыхДанных,СценарийПереданныхДанных", 
			СценарийСинхронизации, СценарийОбъединения, СценарийСинхронизации);
	Иначе
		Изменения = Новый Структура("СценарийЗапрашиваемыхДанных,ЗатребованныйСценарий,СценарийПереданныхДанных", 
			СценарийОбъединения, СценарийОбъединения, СценарийОбъединения);
	КонецЕсли;
	
	СинхронизацияАвтономныхКопий.ЗаписатьНовыеПараметрыОбменаСУзлом(ЦентральнаяБаза, Изменения);
	
	ПрочитатьНастройкиИРезультаты();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыполнитьПроверкуСервер(УзелЦБ)
	
	Результат = ДеньгиОбменСЦентральнойБазой.ВыполнитьПроверкуРезультатовСинхронизации(, УзелЦБ);
	Если ЗначениеЗаполнено(Результат) Тогда
		ТекДок = Новый ТекстовыйДокумент;
		ТекДок.УстановитьТекст(НСтр("ru='Выявлены следующие расхождения:'") + символы.ПС + символы.ПС + СтрСоединить(Результат, символы.ПС));
		Возврат ТекДок;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции


#КонецОбласти
